{"topic_intro": "The Express had a very high number of clusters, and as the plot shows this covered a very wide variety of topics. The top topic across the full time range was Scottish independence. However, similar to other news sources around the start of 2022 the war in Ukraine became by far the most frequent headline topic, and this was the 3rd most common topic overall, despite having barely any coverage until mid-2021.\nThe royals the most frequent category within the top 10 topics. Kate Middleton and her fashion/jewellery were the second most popular topic, but Meghan Markle made it into two of the top 10 clusters, number 4 (which centred on her supposed effect on relationships between other family members, using words like 'rift' and 'Megxit') and number 7 (which used similar language but was more focused on her as an individual). The potential for abdication was the 10th most popular topic, frequently mentioning Prince William and becoming a bigger topic as time went on.\nOther than these, the top topics covered cleaning hacks, football, television and tennis.\nOther than the royals, individuals who were defining parts of the top topics were Putin, Manchester Utd. manager Ole Gunnar Solskjær and tennis players Federer and Alcaraz.", 
"polarity_comments": "For the Express, the plurality but not the majority (around 44%) of headlines were neutral in their language, followed by ~35% which were positive and 21% that were negative.\nAverage polarity was neutral to slightly positive, roughly 0.04. Polarity fluctuated slightly over time but without any clear trend. The most negative month was November 2022, shortly after the most positive month in September 2022.", 
"subjectivity_comments": "Mean and median subjectivity were both around 0.3 indicating mostly objective language with some subjective language.\nThis trended slightly more subjective over time. Over a quarter of headlines were more subjective than objective, with the top quartile of subjectivity starting at 0.55. At least a quarter of headlines were neutral.", 
"extra_info": ""}