{"topic_intro": "The Guardian's biggest topic clusters concerned politics, primarily the Conservatives and to a lesser extent Labour, often seeming to talk about the Tory party as a whole and Keir Starmer as an individual.\n\nThe word 'reshuffle' was one of the defining words of their biggest cluster, reflecting the turbulent politics of the time period covered.\n\nOf the top 10 topics, the Tories were a defining part of 3 of them.\n\nLockdown and the impact of COVID on business was the second largest cluster, which peaked in late 2020 but interestingly seemed to be becoming a popular topic again going into 2023.\n\nThe NHS was one of the top topics, becoming a more frequent topic of headlines over time, especially since 2022.\n\nMiscellaneous topics that were in the top 10 for The Guardian included wildlife, obituaries and space.", 
"polarity_comments": "With the Guardian, analysis shows that the majority of headlines (58%) were neutral, followed by positive headlines (around 24%), and negative headlines were least fequent (around 18%).\n\nAverage polarity was very slightly positive, with little variation over time.\n\nThe most positive month was 0.035 in March 2021, and the most negative month was the most recent - 0.0025 (still marginally positive) in January 2023.\n\nThe trend was for headlines to get more positive until early 2021, when they started to trend more negative (or less positive) over time until the start of 2023.", 
"subjectivity_comments": "The mean subjectivity of Guardian headlines was around 0.22, indicating mostly objective language with some subjectivity.\n\nAgain, subjectivity over time didn't change very dramatically, but showed a clear trend of becoming slightly more subjecive over time between late 2019 and early 2023.\n\nThe most objective month was May 2020 at 0.2, and the most subjective month was October 2022 at 0.26.\n\nThe data did include headlines that were completely subjective and headlines that were completely objective.\n\nOver three quarters were more objective than subjective, with the upper quartile ranging from 0.417 to 1. The median subjectivity was 0, so most headlines were completely objective in their language.", 
"extra_info": ""}