{"topic_intro": "The Daily Mail had a very large quantity of data and lots of clusters. The top topic by far is the war in Ukraine, which contained twice the number of documents as the next largest cluster, despite the number 2 cluster being a broader one around pets and funny animals.\nThe 4th largest topic was around quarantine, leaning towards stories about Australian policy on COVID-19, which was the number one topic in mid 2020 and again in mid 2021.\nSexual crime was the 3rd most common headline topic, with a focus on crimes against children.\nSpace formed the 5th largest cluster, with the major parts of this being NASA and Starlink as well as the James Webb telescope.\nSports was one of the top topics, but this predominantly revolved around sport in the USA.\nPeaking in mid-2020, education was a major topic, with the cluster focusing on the UK education secretary at the time, exam results and the prospect of schools re-opening.\nOther topics included the weather, mortgages and cards (mainly Tesla).\nIndividuals that defined the clusters were polticians (Gavin Williamson, Vladimir Putin, Volodymyr Zelenskyy, Daniel Andrews), as well as athletes (Kobe Bryant and Tom Brady), and Elon Musk.",
"polarity_comments": "Headlines from the Mail were around 41% neutral, 33% positive and 26% negative in terms of polarity.\nFrom the start of 2021 to the end of 2022 there was a trend of polarity getting slightly more negative over time, although it seemed that this may be starting to reverse at the start of 2023.\nMean polarity was neutral to slightly positive at around 0.02.", 
"subjectivity_comments": "For the Daily Mail, median subjectivity was around 0.37, suggesting relatively subjective language used that still had an objective core.\nWhere many of the other newspapers had a significant number of extremely objective headlines, the Mail had a lower quartile distinct from the minimum, between 0 and 0.1. The Daily Mail still had headlines that were completely objective or completely subjective.\nMean subjectivity was around the same as the median - 0.37. The highest subjectivity was in February 2020 and the lowest subjectivity was in April 2021.", 
"extra_info": ""}