{"topic_intro": "Metro's top topics focused less on politics than other newspapers, with the only major topic cluster in the top 10 being the war in Ukraine, which was by far the most common headline topic around the start to middle of 2022. Other major topics tended to focus on television and sport.\n\nImportantly, the way that data was collected meant that most other newspapers did not have their coverage of TV and showbiz included in the data or analysis, so it may be the case that this is less distinct than it appears.\n\nThe two topic was a combination of very different topics - sports (mostly wrestling) and educational grades - due to the crossover in language used relating to 'results'. This may be an area of improvement with better parameters in future.\n\nTelevision stories formed several topic clusters, particularly around soap operas, Netflix and GMB. The GMB cluster seemed to have a slight political angle, with Boris Johnson featuring in the defining words.\n\nOther individuals featured in the top clusters included fictional characters as well as Putin, Zelensky, and Piers Morgan.\n\nOther topic clusters also covered obituaries and pets.", 
"polarity_comments": "The plurality (but not the majority) of Metro headlines were neutral, the second biggest group was positive headlines at around 32%, followed by negative headlines at around 20%.\n\nMean polarity was slightly positive, with the most positive month occuring in July 2022 with mean polarity of around 0.07. The most negative month was still slightly positive, 0.028 in November 2022.\n\nFluctuations in polarity were quite random over time, with later months varying more in polarity than earlier months that were slightly more stable on average.", 
"subjectivity_comments": "Metro's mean subjectivity was just under 0.3, indicating some subjective language in mostly objective headlines.\n\nSubjectivity didn't change much over time, but trended slightly more subjective by month over time.\n\nMedian subjectivity was 0.2, indicating that most headlines were mostly objective.\n\nThe dataset included headlines that were both completely objective and completely subjective. Three quarters of headlines were more objective than subjective, with the upper quartile spanning 0.5 to 1 in subjectivity."
}