{"topic_intro": "Within the Sun data, the largest topic was around deals and promotions especially in supermarkets and restaurants, which was a consistently common topic across the years covered.\n\nThe Sun's 2nd most frequent topic over this time period was the war in Ukraine, which was the most popular cluster by far from the start of 2022.\n\nCompared to other newspapers, the Sun seemed to focus more on individual tragedies experienced by people who aren't public figures. Examples of this include the 3rd biggest topic being around mothers' heartbreak, the 7th biggest topic which was around people being injured doing daily activities, and the 8th biggest topic being around vehicle crashes and the resulting injuries. Sexual assault was also the focus of the 5th largest cluster.\n\nIndividuals who appeared as defining parts of the top clusters were Vladimir Putin, Kier Starmer, Jeremy Corbyn, Meghan Markle and Rishi Sunak.\n\nInterestingly, when initially running the analysis with slightly different parameters, Meghan Markle was the second most frequent cluster after the war in Ukraine, and there is a time period around the start of 2021 where she is still the most popular headline topic, just above the COVID-19 vaccine.\n\nWhen it comes to politics, Rishi Sunak is mentioned around the topic of taxes, and Starmer and Corbyn are part of the same topic cluster as each other, which is significantly larger than the Sunak cluster.", 
"polarity_comments": "The plurality (but not the majority) of Sun headlines are netural at 40%, followed by negative headlines at 30%, and positive headlines are slightly less common at 29%.\n\nMean polarity is slightly negative (around -0.01), and this fluctuates slightly and somewhat randomly over time. The most positive month is February 2021 at 0.011, and the most negative month is -0.04 in August 2021.\n\nSince this low, polarity has been trending slightly upwards over time, with headlines getting more positive, but remaining slightly negative on average.", 
"subjectivity_comments": "For the Sun, mean subjectivity was around 0.33, indicating mostly objective language with some subjective language.\n\n Subjectivity stayed quite stable over time, with a sharp increase in subjectivity from November 2022 to January 2023. The two most subjective months were the last two months in the data.\n\nMedian subjectivity was 0.277, and most headlines were slightly subjective. The data included headlines that were both completely subjective and completely objective.\n\nAround 3 quarters of the headlines were more objective than subjective, with the upper quartile spanning from 0.533 to 1 in subjectivity.", 
"extra_info": ""}