{"topic_intro": "The Telegraph's top 10 topics were dominated by UK politics and COVID-19, but the largest cluster by far was the war in Ukraine which has been the most common headline subject since late 2021.\nCoronavirus featured in 4 of the top 10 topics, with the top of these being the 2nd most popular topic concerning the Tory policies around the virus. The 4th most common topic was primarily around Scottish politics but Coronavirus was a defining word within it. The 5th and 6th most common topics covered lockdowns and the vaccine for the virus. These topics that primarily were about COVID-19 peaked in frequency relatively early, peaking before the start of 2021.\nIn terms of UK politics, the second biggest topic used words like 'reshuffle' for the Tory party, and the 9th biggest topic used the word 'watchdog' also in reference to the Tories.\nOther major topics included the environment, the royals, crime and US presidential politics.\nIndividuals who were mentioned as defining parts of the top topics were Vladimir Putin, Volodymyr Zelenskyy, Joe Biden, Kamala Harris, Nicola Sturgeon, Greta Thunberg and Meghan Markle. Cochrane is a name that appears in the cluster for the SNP, but this is the name of the author who runs a 'Cochrane's Scotland' series on Scottish Politics and as such this was present in many of the headlines around Scotland.", 
"polarity_comments": "The majority of Telegraph headlines (~52%) were neutral in polarity, followed by around 27% positive and 20% negative. Average polarity was neutral to slightly positive, and trended slightly more negative over time.\nThe most negative month was neutral on average and occurred in November 2022.", 
"subjectivity_comments": "Mean subjectivity for the Telegraph was around 0.24, indicating mostly objective headlines with some subjective language. Subjectivity was trending slightly more objective over time, but headlines became more subjective from mid-2022. The most subjective month for headlines was September 2022.\nThe dataset included Telegraph headlines that had subjectivity of both 0 and 1, but the median subjectivity was 0.1 and the lowest quartile was the same as the minimum indicating lots of headlines that used objective language.\nRoughly a quarter of headlines were equally or more subjective than objective, with the top quartile spanning from around 0.45 to 1 in subjectivity.", 
"extra_info": ""}